tap "bgreenwell/lstr"
tap "dart-lang/dart"
tap "homebrew/cask"
tap "homebrew/core"
tap "isen-ng/dotnet-sdk-versions"
tap "jstkdng/programs"
tap "microsoft/mssql-release"
tap "mint-lang/mint-lang"
tap "mpryor/tap"
tap "oug-t/difi"
tap "oven-sh/bun"
tap "shopify/shopify"
tap "stripe/stripe-cli"
tap "yarlson/lnk"
tap "ynqa/tap"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Simple, modern, secure file encryption
brew "age"
# Age plugin for Apple Secure Enclave
brew "age-plugin-se"
# Plugin for encrypting files with age and PIV tokens such as YubiKeys
brew "age-plugin-yubikey"
# Color management engine supporting ICC profiles
brew "little-cms2"
# New file format for still image compression
brew "jpeg-xl"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Next generation of apngasm, the APNG assembler
brew "apngasm"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Spell checker with better logic than ispell
brew "aspell"
# Core application library for C
brew "glib"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Modern, simple TCP tunnel in Rust that exposes local ports to a remote server
brew "bore-cli"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Concurrent, cache-efficient, and Dockerfile-agnostic builder toolkit
brew "buildkit"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Vector graphics library with cross-device output support
brew "cairo"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Library for encoding and decoding .avif files
brew "libavif"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Create and run Linux containers using lightweight virtual machines
brew "container", link: false
# GNU File, Shell, and Text utilities
brew "coreutils"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# JSON, YAML, TOML, XML, and CSV query and modification tool
brew "dasel"
# Tools to manipulate dates with a focus on financial data
brew "dateutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Diff that understands syntax
brew "difftastic"
# Tool for exploring each layer in a docker image
brew "dive"
# Command-line tool for DigitalOcean
brew "doctl"
# Command-line DNS Client for Humans
brew "doggo"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Intelligent archive extraction
brew "dtrx"
# More intuitive version of du in rust
brew "dust"
# Functional programming language for building browser-based GUIs
brew "elm"
# Run arbitrary commands when files change
brew "entr"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Throw a tag at and it comes back with a checksum
brew "frizbee"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Command-line downloader for image-hosting site galleries and collections
brew "gallery-dl"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12", link: false
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false
# Secure Reliable Transport
brew "srt"
# Turn movies into GIFs
brew "gifify"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Gnumeric spreadsheet program
brew "goffice"
# Library access to GnuPG
brew "gpgme"
# Ping, but with a graph
brew "gping"
# Make JSON greppable
brew "gron"
# Kubernetes package manager
brew "helm"
# HTML validator written in Go
brew "htmltest"
# Improved top (interactive process viewer)
brew "htop"
# Ping-like tool for HTTP requests
brew "httping"
# Command-line benchmarking tool
brew "hyperfine"
# Display an interface's bandwidth usage
brew "iftop"
# Git-compatible distributed version control system
brew "jj"
# Convert JPG images to ASCII
brew "jp2a"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Fast, Dynamic Programming Language
brew "julia"
# Handy way to save and run project-specific commands
brew "just"
# Command-line tool to kill processes listening on a specific port
brew "killport"
# High-performance authoritative-only DNS server
brew "knot"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12", link: false
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Postgres C API library
brew "libpq"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Use Realtek DVB-T dongles as a cheap SDR
brew "librtlsdr"
# General purpose TCP-IP emulator
brew "libslirp"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Next-gen compiler infrastructure
brew "llvm"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Package manager for the Lua programming language
brew "luarocks"
# Apple Silicon Monitor Top written in Go Lang
brew "mactop"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Sign files & verify signatures. Works with signify in OpenBSD
brew "minisign"
# Cross platform, open source .NET development framework
brew "mono"
# Remote terminal application
brew "mosh"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Incremental parsing library
brew "tree-sitter"
# Control nvim processes using `nvr` command-line tool
brew "neovim-remote"
# Net top tool grouping bandwidth per process
brew "nethogs"
# Statically typed compiled systems programming language
brew "nim"
# Programs for dealing with numbers from the command-line
brew "num-utils"
# Create, run, and share large language models (LLMs)
brew "ollama"
# General-purpose speech recognition model
brew "openai-whisper"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Shell command parallelization utility
brew "parallel"
# Pins GitHub Actions to full hashes and versions
brew "pinact"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# CLI for the Pkl programming language
brew "pkl"
# Language server for Pkl
brew "pkl-lsp"
# Paste PNG into files
brew "pngpaste"
# PNG image optimizing utility
brew "pngquant"
# Alternative to docker-compose using podman
brew "podman-compose"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Command-line shell and scripting language
brew "powershell", link: false
# Simple, powerful, pipelined SQL replacement
brew "prqlc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false
# Generic machine emulator and virtualizer
brew "qemu"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Rsync for cloud storage
brew "rclone"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Tools for file renaming
brew "renameutils"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Safe, concurrent, practical language
brew "rust"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Small man page generator
brew "scdoc"
# Interactive find and replace in the terminal
brew "scooter"
# Static http server anywhere you need one
brew "serve"
# Cryptographically sign and verify files
brew "signify-osx"
# Fuzzy Finder in rust!
brew "sk"
# Work with remote images registries
brew "skopeo"
# Editor of encrypted files
brew "sops"
# Sparklines for the shell
brew "spark"
# Soak up standard input and write to a file
brew "sponge"
# Secure Reliable Transport
brew "srt"
# SSH server & client auditing
brew "ssh-audit"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Swift toolchain installer and manager
brew "swiftly"
# Online backups for the truly paranoid
brew "tarsnap"
# Powerful free data recovery utility
brew "testdisk"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Microsoft MS-TNEF attachment unpacker
brew "tnef"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Command-line tool for URL parsing and manipulation
brew "trurl"
# Realtime plotting utility for terminal with data input from stdin
brew "ttyplot"
# Text manipulation and cutting tool
brew "tuc"
# Language for application scale JavaScript development
brew "typescript"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Command-line tool for Vapor (Server-side Swift web framework)
brew "vapor"
# Why is this running?
brew "witr"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Language Server for Zig
brew "zls"
# A fast, minimalist directory tree viewer
brew "bgreenwell/lstr/lstr"
# SDK
brew "dart-lang/dart/dart"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# Refreshing programming language for the front-end web
brew "mint-lang/mint-lang/mint-lang"
# Nothing Less - A TUI for parsing and arranging tabular data
brew "mpryor/tap/nless"
# The pixel-perfect terminal diff viewer
brew "oug-t/difi/difi"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# A CLI tool to build for the Shopify platform
brew "shopify/shopify/shopify-cli"
brew "shopify/shopify/theme-check"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Git-native dotfiles management that doesn't suck
brew "yarlson/lnk/lnk"
# JSON navigator and interactive filter leveraging jq
brew "ynqa/tap/jnv"
# Multi-track audio editor and recorder
cask "audacity"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# E-books management software
cask "calibre"
# Anthropic's official Claude AI desktop app
cask "claude"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Command-line display management utility
cask "cscreen"
# Voice and text chat software
cask "discord"
# Developer platform
cask "dotnet-sdk"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk8"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk8-0-400"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source keystroke visualiser
cask "keycastr"
# Native chat application for all major LLM APIs
cask "macai"
# Speech recognition tool
cask "macwhisper"
# Run Stable Diffusion natively
cask "mochi-diffusion"
# Discord music status that works with any media player
cask "music-presence"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Free and open-source productivity suite
cask "openoffice"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Command-line shell and scripting language
cask "powershell"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# .NET IDE
cask "rider"
# Store SSH keys in the Secure Enclave
cask "secretive"
# Interactive log viewer for MSBuild structured logs (*.binlog)
cask "structuredlogviewer"
# Web browser focusing on security
cask "tor-browser"
# Keyboard configurator
cask "via"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Multiplayer code editor
cask "zed"
cargo "shreddit"
