{
  "catppuccin": { "branch": "main" },
  "cmp-buffer": { "branch": "main" },
  "cmp-cmdline": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-nvim-lsp-signature-help": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp-vsnip": { "branch": "main" },
  "csharp-language-server": { "branch": "main" },
  "dressing.nvim": { "branch": "master" },
  "fish-lsp": { "branch": "master" },
  "fzf": { "branch": "master" },
  "git-conflict.nvim": { "branch": "main" },
  "indent-blankline.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "neo-tree.nvim": { "branch": "v3.x" },
  "neofsharp.vim": { "branch": "master" },
  "nerdcommenter": { "branch": "master" },
  "nui.nvim": { "branch": "main" },
  "nvim-base64": { "branch": "main" },
  "nvim-cmp": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-pqf": { "branch": "main" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "vim-applescript": { "branch": "master" },
  "vim-cool": { "branch": "master" },
  "vim-fish-syntax": { "branch": "master" },
  "vim-jsx-typescript": { "branch": "master" },
  "vim-mint": { "branch": "master" },
  "vim-mustache-handlebars": { "branch": "master" },
  "vim-stylus": { "branch": "master" },
  "vim-vsnip": { "branch": "master" }
}
